benchmark-results/tirion-cpp-mixed-rinha-like.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /b/mixed-rinha-like.js
        output: -

     scenarios: (100.00%) 1 scenario, 250 max VUs, 2m20s max duration (incl. graceful stop):
              * default: Up to 250 looping VUs for 1m50s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/250 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 002/250 VUs  0m01.0s/1m50.0s

running (0m02.0s), 004/250 VUs, 82 complete and 0 interrupted iterations
default   [   2% ] 004/250 VUs  0m02.0s/1m50.0s

running (0m03.0s), 006/250 VUs, 170 complete and 0 interrupted iterations
default   [   3% ] 006/250 VUs  0m03.0s/1m50.0s

running (0m04.0s), 008/250 VUs, 292 complete and 0 interrupted iterations
default   [   4% ] 008/250 VUs  0m04.0s/1m50.0s

running (0m05.0s), 010/250 VUs, 451 complete and 0 interrupted iterations
default   [   5% ] 010/250 VUs  0m05.0s/1m50.0s

running (0m06.0s), 012/250 VUs, 641 complete and 0 interrupted iterations
default   [   5% ] 012/250 VUs  0m06.0s/1m50.0s

running (0m07.0s), 014/250 VUs, 865 complete and 0 interrupted iterations
default   [   6% ] 014/250 VUs  0m07.0s/1m50.0s

running (0m08.0s), 016/250 VUs, 1095 complete and 0 interrupted iterations
default   [   7% ] 016/250 VUs  0m08.0s/1m50.0s

running (0m09.0s), 018/250 VUs, 1361 complete and 0 interrupted iterations
default   [   8% ] 018/250 VUs  0m09.0s/1m50.0s

running (0m10.0s), 019/250 VUs, 1626 complete and 0 interrupted iterations
default   [   9% ] 019/250 VUs  0m10.0s/1m50.0s

running (0m11.0s), 023/250 VUs, 1846 complete and 0 interrupted iterations
default   [  10% ] 023/250 VUs  0m11.0s/1m50.0s

running (0m12.0s), 027/250 VUs, 2103 complete and 0 interrupted iterations
default   [  11% ] 027/250 VUs  0m12.0s/1m50.0s

running (0m13.0s), 031/250 VUs, 2305 complete and 0 interrupted iterations
default   [  12% ] 031/250 VUs  0m13.0s/1m50.0s

running (0m14.0s), 035/250 VUs, 2504 complete and 0 interrupted iterations
default   [  13% ] 035/250 VUs  0m14.0s/1m50.0s

running (0m15.0s), 039/250 VUs, 2721 complete and 0 interrupted iterations
default   [  14% ] 039/250 VUs  0m15.0s/1m50.0s

running (0m16.0s), 043/250 VUs, 2899 complete and 0 interrupted iterations
default   [  15% ] 043/250 VUs  0m16.0s/1m50.0s

running (0m17.0s), 047/250 VUs, 3020 complete and 0 interrupted iterations
default   [  15% ] 047/250 VUs  0m17.0s/1m50.0s

running (0m18.0s), 051/250 VUs, 3216 complete and 0 interrupted iterations
default   [  16% ] 051/250 VUs  0m18.0s/1m50.0s

running (0m19.0s), 055/250 VUs, 3354 complete and 0 interrupted iterations
default   [  17% ] 055/250 VUs  0m19.0s/1m50.0s

running (0m20.0s), 059/250 VUs, 3535 complete and 0 interrupted iterations
default   [  18% ] 059/250 VUs  0m20.0s/1m50.0s

running (0m21.0s), 063/250 VUs, 3710 complete and 0 interrupted iterations
default   [  19% ] 063/250 VUs  0m21.0s/1m50.0s

running (0m22.0s), 067/250 VUs, 3968 complete and 0 interrupted iterations
default   [  20% ] 067/250 VUs  0m22.0s/1m50.0s

running (0m23.0s), 071/250 VUs, 4187 complete and 0 interrupted iterations
default   [  21% ] 071/250 VUs  0m23.0s/1m50.0s

running (0m24.0s), 075/250 VUs, 4412 complete and 0 interrupted iterations
default   [  22% ] 075/250 VUs  0m24.0s/1m50.0s

running (0m25.0s), 079/250 VUs, 4652 complete and 0 interrupted iterations
default   [  23% ] 079/250 VUs  0m25.0s/1m50.0s

running (0m26.0s), 083/250 VUs, 4890 complete and 0 interrupted iterations
default   [  24% ] 083/250 VUs  0m26.0s/1m50.0s

running (0m27.0s), 087/250 VUs, 5136 complete and 0 interrupted iterations
default   [  25% ] 087/250 VUs  0m27.0s/1m50.0s

running (0m28.0s), 091/250 VUs, 5372 complete and 0 interrupted iterations
default   [  25% ] 091/250 VUs  0m28.0s/1m50.0s

running (0m29.0s), 095/250 VUs, 5579 complete and 0 interrupted iterations
default   [  26% ] 095/250 VUs  0m29.0s/1m50.0s

running (0m30.0s), 099/250 VUs, 5757 complete and 0 interrupted iterations
default   [  27% ] 099/250 VUs  0m30.0s/1m50.0s

running (0m31.0s), 102/250 VUs, 5996 complete and 0 interrupted iterations
default   [  28% ] 102/250 VUs  0m31.0s/1m50.0s

running (0m32.0s), 104/250 VUs, 6234 complete and 0 interrupted iterations
default   [  29% ] 104/250 VUs  0m32.0s/1m50.0s

running (0m33.0s), 107/250 VUs, 6473 complete and 0 interrupted iterations
default   [  30% ] 107/250 VUs  0m33.0s/1m50.0s

running (0m34.0s), 109/250 VUs, 6687 complete and 0 interrupted iterations
default   [  31% ] 109/250 VUs  0m34.0s/1m50.0s

running (0m35.0s), 112/250 VUs, 6927 complete and 0 interrupted iterations
default   [  32% ] 112/250 VUs  0m35.0s/1m50.0s

running (0m36.0s), 114/250 VUs, 7134 complete and 0 interrupted iterations
default   [  33% ] 114/250 VUs  0m36.0s/1m50.0s

running (0m37.0s), 117/250 VUs, 7321 complete and 0 interrupted iterations
default   [  34% ] 117/250 VUs  0m37.0s/1m50.0s

running (0m38.0s), 119/250 VUs, 7495 complete and 0 interrupted iterations
default   [  35% ] 119/250 VUs  0m38.0s/1m50.0s

running (0m39.0s), 122/250 VUs, 7720 complete and 0 interrupted iterations
default   [  35% ] 122/250 VUs  0m39.0s/1m50.0s

running (0m40.0s), 124/250 VUs, 7896 complete and 0 interrupted iterations
default   [  36% ] 124/250 VUs  0m40.0s/1m50.0s

running (0m41.0s), 127/250 VUs, 8107 complete and 0 interrupted iterations
default   [  37% ] 127/250 VUs  0m41.0s/1m50.0s

running (0m42.0s), 129/250 VUs, 8341 complete and 0 interrupted iterations
default   [  38% ] 129/250 VUs  0m42.0s/1m50.0s

running (0m43.0s), 132/250 VUs, 8553 complete and 0 interrupted iterations
default   [  39% ] 132/250 VUs  0m43.0s/1m50.0s

running (0m44.0s), 134/250 VUs, 8745 complete and 0 interrupted iterations
default   [  40% ] 134/250 VUs  0m44.0s/1m50.0s

running (0m45.0s), 137/250 VUs, 8926 complete and 0 interrupted iterations
default   [  41% ] 137/250 VUs  0m45.0s/1m50.0s

running (0m46.0s), 139/250 VUs, 9143 complete and 0 interrupted iterations
default   [  42% ] 139/250 VUs  0m46.0s/1m50.0s

running (0m47.0s), 142/250 VUs, 9356 complete and 0 interrupted iterations
default   [  43% ] 142/250 VUs  0m47.0s/1m50.0s

running (0m48.0s), 144/250 VUs, 9533 complete and 0 interrupted iterations
default   [  44% ] 144/250 VUs  0m48.0s/1m50.0s

running (0m49.0s), 147/250 VUs, 9725 complete and 0 interrupted iterations
default   [  45% ] 147/250 VUs  0m49.0s/1m50.0s

running (0m50.0s), 149/250 VUs, 9915 complete and 0 interrupted iterations
default   [  45% ] 149/250 VUs  0m50.0s/1m50.0s

running (0m51.0s), 152/250 VUs, 10086 complete and 0 interrupted iterations
default   [  46% ] 152/250 VUs  0m51.0s/1m50.0s

running (0m52.0s), 154/250 VUs, 10251 complete and 0 interrupted iterations
default   [  47% ] 154/250 VUs  0m52.0s/1m50.0s

running (0m53.0s), 157/250 VUs, 10449 complete and 0 interrupted iterations
default   [  48% ] 157/250 VUs  0m53.0s/1m50.0s

running (0m54.0s), 159/250 VUs, 10631 complete and 0 interrupted iterations
default   [  49% ] 159/250 VUs  0m54.0s/1m50.0s

running (0m55.0s), 162/250 VUs, 10807 complete and 0 interrupted iterations
default   [  50% ] 162/250 VUs  0m55.0s/1m50.0s

running (0m56.0s), 164/250 VUs, 11010 complete and 0 interrupted iterations
default   [  51% ] 164/250 VUs  0m56.0s/1m50.0s

running (0m57.0s), 167/250 VUs, 11206 complete and 0 interrupted iterations
default   [  52% ] 167/250 VUs  0m57.0s/1m50.0s

running (0m58.0s), 169/250 VUs, 11418 complete and 0 interrupted iterations
default   [  53% ] 169/250 VUs  0m58.0s/1m50.0s

running (0m59.0s), 172/250 VUs, 11586 complete and 0 interrupted iterations
default   [  54% ] 172/250 VUs  0m59.0s/1m50.0s

running (1m00.0s), 174/250 VUs, 11789 complete and 0 interrupted iterations
default   [  55% ] 174/250 VUs  1m00.0s/1m50.0s

running (1m01.0s), 177/250 VUs, 11939 complete and 0 interrupted iterations
default   [  55% ] 177/250 VUs  1m01.0s/1m50.0s

running (1m02.0s), 179/250 VUs, 12099 complete and 0 interrupted iterations
default   [  56% ] 179/250 VUs  1m02.0s/1m50.0s

running (1m03.0s), 182/250 VUs, 12316 complete and 0 interrupted iterations
default   [  57% ] 182/250 VUs  1m03.0s/1m50.0s

running (1m04.0s), 184/250 VUs, 12552 complete and 0 interrupted iterations
default   [  58% ] 184/250 VUs  1m04.0s/1m50.0s

running (1m05.0s), 187/250 VUs, 12745 complete and 0 interrupted iterations
default   [  59% ] 187/250 VUs  1m05.0s/1m50.0s

running (1m06.0s), 189/250 VUs, 12927 complete and 0 interrupted iterations
default   [  60% ] 189/250 VUs  1m06.0s/1m50.0s

running (1m07.0s), 192/250 VUs, 13092 complete and 0 interrupted iterations
default   [  61% ] 192/250 VUs  1m07.0s/1m50.0s

running (1m08.0s), 194/250 VUs, 13271 complete and 0 interrupted iterations
default   [  62% ] 194/250 VUs  1m08.0s/1m50.0s

running (1m09.0s), 197/250 VUs, 13443 complete and 0 interrupted iterations
default   [  63% ] 197/250 VUs  1m09.0s/1m50.0s

running (1m10.0s), 199/250 VUs, 13620 complete and 0 interrupted iterations
default   [  64% ] 199/250 VUs  1m10.0s/1m50.0s

running (1m11.0s), 202/250 VUs, 13805 complete and 0 interrupted iterations
default   [  65% ] 202/250 VUs  1m11.0s/1m50.0s

running (1m12.0s), 204/250 VUs, 14017 complete and 0 interrupted iterations
default   [  65% ] 204/250 VUs  1m12.0s/1m50.0s

running (1m13.0s), 207/250 VUs, 14153 complete and 0 interrupted iterations
default   [  66% ] 207/250 VUs  1m13.0s/1m50.0s

running (1m14.0s), 209/250 VUs, 14281 complete and 0 interrupted iterations
default   [  67% ] 209/250 VUs  1m14.0s/1m50.0s

running (1m15.0s), 212/250 VUs, 14433 complete and 0 interrupted iterations
default   [  68% ] 212/250 VUs  1m15.0s/1m50.0s

running (1m16.0s), 214/250 VUs, 14494 complete and 0 interrupted iterations
default   [  69% ] 214/250 VUs  1m16.0s/1m50.0s

running (1m17.0s), 217/250 VUs, 14540 complete and 0 interrupted iterations
default   [  70% ] 217/250 VUs  1m17.0s/1m50.0s

running (1m18.0s), 219/250 VUs, 14625 complete and 0 interrupted iterations
default   [  71% ] 219/250 VUs  1m18.0s/1m50.0s

running (1m19.0s), 222/250 VUs, 14701 complete and 0 interrupted iterations
default   [  72% ] 222/250 VUs  1m19.0s/1m50.0s

running (1m20.0s), 224/250 VUs, 14764 complete and 0 interrupted iterations
default   [  73% ] 224/250 VUs  1m20.0s/1m50.0s

running (1m21.0s), 227/250 VUs, 14819 complete and 0 interrupted iterations
default   [  74% ] 227/250 VUs  1m21.0s/1m50.0s

running (1m22.0s), 229/250 VUs, 14857 complete and 0 interrupted iterations
default   [  75% ] 229/250 VUs  1m22.0s/1m50.0s

running (1m23.0s), 232/250 VUs, 14903 complete and 0 interrupted iterations
default   [  75% ] 232/250 VUs  1m23.0s/1m50.0s

running (1m24.0s), 234/250 VUs, 14950 complete and 0 interrupted iterations
default   [  76% ] 234/250 VUs  1m24.0s/1m50.0s

running (1m25.0s), 237/250 VUs, 14984 complete and 0 interrupted iterations
default   [  77% ] 237/250 VUs  1m25.0s/1m50.0s

running (1m26.0s), 239/250 VUs, 15029 complete and 0 interrupted iterations
default   [  78% ] 239/250 VUs  1m26.0s/1m50.0s

running (1m27.0s), 242/250 VUs, 15072 complete and 0 interrupted iterations
default   [  79% ] 242/250 VUs  1m27.0s/1m50.0s

running (1m28.0s), 244/250 VUs, 15108 complete and 0 interrupted iterations
default   [  80% ] 244/250 VUs  1m28.0s/1m50.0s

running (1m29.0s), 247/250 VUs, 15150 complete and 0 interrupted iterations
default   [  81% ] 247/250 VUs  1m29.0s/1m50.0s

running (1m30.0s), 249/250 VUs, 15173 complete and 0 interrupted iterations
default   [  82% ] 249/250 VUs  1m30.0s/1m50.0s

running (1m31.0s), 250/250 VUs, 15196 complete and 0 interrupted iterations
default   [  83% ] 250/250 VUs  1m31.0s/1m50.0s

running (1m32.0s), 248/250 VUs, 15215 complete and 0 interrupted iterations
default   [  84% ] 248/250 VUs  1m32.0s/1m50.0s

running (1m33.0s), 245/250 VUs, 15252 complete and 0 interrupted iterations
default   [  85% ] 245/250 VUs  1m33.0s/1m50.0s

running (1m34.0s), 241/250 VUs, 15288 complete and 0 interrupted iterations
default   [  85% ] 241/250 VUs  1m34.0s/1m50.0s

running (1m35.0s), 236/250 VUs, 15318 complete and 0 interrupted iterations
default   [  86% ] 236/250 VUs  1m35.0s/1m50.0s

running (1m36.0s), 230/250 VUs, 15348 complete and 0 interrupted iterations
default   [  87% ] 230/250 VUs  1m36.0s/1m50.0s

running (1m37.0s), 220/250 VUs, 15383 complete and 0 interrupted iterations
default   [  88% ] 220/250 VUs  1m37.0s/1m50.0s

running (1m38.0s), 198/250 VUs, 15426 complete and 0 interrupted iterations
default   [  89% ] 198/250 VUs  1m38.0s/1m50.0s

running (1m39.0s), 192/250 VUs, 15443 complete and 0 interrupted iterations
default   [  90% ] 192/250 VUs  1m39.0s/1m50.0s

running (1m40.0s), 176/250 VUs, 15479 complete and 0 interrupted iterations
default   [  91% ] 176/250 VUs  1m40.0s/1m50.0s

running (1m41.0s), 164/250 VUs, 15512 complete and 0 interrupted iterations
default   [  92% ] 164/250 VUs  1m41.0s/1m50.0s

running (1m42.0s), 150/250 VUs, 15547 complete and 0 interrupted iterations
default   [  93% ] 150/250 VUs  1m42.0s/1m50.0s

running (1m43.0s), 137/250 VUs, 15576 complete and 0 interrupted iterations
default   [  94% ] 137/250 VUs  1m43.0s/1m50.0s

running (1m44.0s), 122/250 VUs, 15605 complete and 0 interrupted iterations
default   [  95% ] 122/250 VUs  1m44.0s/1m50.0s

running (1m45.0s), 100/250 VUs, 15651 complete and 0 interrupted iterations
default   [  95% ] 100/250 VUs  1m45.0s/1m50.0s

running (1m46.0s), 086/250 VUs, 15683 complete and 0 interrupted iterations
default   [  96% ] 086/250 VUs  1m46.0s/1m50.0s

running (1m47.0s), 061/250 VUs, 15727 complete and 0 interrupted iterations
default   [  97% ] 061/250 VUs  1m47.0s/1m50.0s

running (1m48.0s), 045/250 VUs, 15773 complete and 0 interrupted iterations
default   [  98% ] 045/250 VUs  1m48.0s/1m50.0s

running (1m49.0s), 033/250 VUs, 15815 complete and 0 interrupted iterations
default   [  99% ] 033/250 VUs  1m49.0s/1m50.0s

running (1m50.0s), 019/250 VUs, 15836 complete and 0 interrupted iterations
default   [ 100% ] 019/250 VUs  1m50.0s/1m50.0s

running (1m51.0s), 002/250 VUs, 15853 complete and 0 interrupted iterations
default ↓ [ 100% ] 019/250 VUs  1m50s


  █ THRESHOLDS 

    http_req_failed{expected_response:true}
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 26796   241.442461/s
    checks_succeeded...: 100.00% 26796 out of 26796
    checks_failed......: 0.00%   0 out of 26796

    ✓ create 201
    ✓ get 200
    ✓ search 200
    ✓ invalid 400
    ✓ count 200

    HTTP
    http_req_duration..............: avg=530.05ms med=305.55ms p(95)=2.25s p(99)=4.99s
      { expected_response:true }...: avg=558.19ms med=340.66ms p(95)=2.35s p(99)=5.01s
    http_req_failed................: 5.06%  1358 out of 26796
      { expected_response:true }...: 0.00%  0 out of 25438
    http_reqs......................: 26796  241.442461/s

    EXECUTION
    iteration_duration.............: avg=947.14ms med=582.25ms p(95)=4.19s p(99)=8.3s 
    iterations.....................: 15855  142.859764/s
    vus............................: 2      min=2             max=250
    vus_max........................: 250    min=250           max=250

    NETWORK
    data_received..................: 28 MB  251 kB/s
    data_sent......................: 4.1 MB 37 kB/s



running (1m51.0s), 000/250 VUs, 15855 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/250 VUs  1m50s